In [13]:
# import libraries
import numpy as np
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [6]:
# Database credentials:
host = "mid-term-project.ca2jkepgjpne.us-east-2.rds.amazonaws.com"
port = "5432"
user = "lhl_student"
pwd = "lhl_student"
database = "mid_term_project"

In [7]:
# Create a connection to the database
postgres_credentials = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'.format(
    username = user,
    password = pwd,
    ipaddress = host,
    port = port,
    dbname = database))
connection = create_engine(postgres_credentials)

In [23]:
# load flights data:
query = '''
SELECT * FROM flights 
ORDER BY RANDOM() 
LIMIT 200000
'''
flights_data = pd.read_sql(sql=query, con=connection)
#flights_data = pd.read_sql_query(query, connection)

In [25]:
# save flights data as csv file
flights_data.to_csv("Data/flights_data.csv", index=False)

In [26]:
flights_data.head(2)

,fl_date,mkt_unique_carrier,branded_code_share,mkt_carrier,mkt_carrier_fl_num,op_unique_carrier,tail_num,op_carrier_fl_num,origin_airport_id,origin,...,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay,first_dep_time,total_add_gtime,longest_add_gtime,no_name
0,2018-10-26,WN,WN,WN,1849,WN,N7828A,1849,13232,MDW,...,251.0,NaN,NaN,NaN,NaN,NaN,None,NaN,NaN,None
1,2018-07-16,UA,UA,UA,673,UA,N14219,673,11042,CLE,...,288.0,NaN,NaN,NaN,NaN,NaN,None,NaN,NaN,None

In [27]:
flights_data.shape

(200000, 42)

In [29]:
# load passengers data:
query = '''
SELECT * FROM passengers 
ORDER BY RANDOM() 
LIMIT 200000
'''
passengers_data = pd.read_sql(sql=query ,con=connection)

In [31]:
# save passengers data as csv file
passengers_data.to_csv("Data/passengers_data.csv", index=False)

In [32]:
passengers_data.shape

(200000, 38)

In [33]:
passengers_data.head(2)

,departures_scheduled,departures_performed,payload,seats,passengers,freight,mail,distance,ramp_to_ramp,air_time,...,dest_country,dest_country_name,aircraft_group,aircraft_type,aircraft_config,year,month,distance_group,class,data_source
0,0.0,1.0,1100.0,6.0,0.0,0.0,0.0,81.0,40.0,36.0,...,US,United States,0,35,3,2019,3,1,L,DU
1,31.0,30.0,456000.0,2280.0,1263.0,0.0,0.0,1648.0,7800.0,6984.0,...,MX,Mexico,6,673,1,2019,3,4,F,IU

In [34]:
# load fuel_comsumptio data:
query = "SELECT * FROM fuel_comsumption"
fuel_data = pd.read_sql(sql=query ,con=connection)

In [35]:
fuel_data.shape

(3035, 25)

In [36]:
fuel_data.head(2)

,month,airline_id,unique_carrier,carrier,carrier_name,carrier_group_new,sdomt_gallons,satl_gallons,spac_gallons,slat_gallons,...,sdomt_cost,satl_cost,spac_cost,slat_cost,sint_cost,ts_cost,tdomt_cost,tint_cost,total_cost,year
0,1,NaN,None,0JQ,None,1,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,5100.0,0.0,5100.0,2016
1,1,21352.0,0WQ,0WQ,Avjet Corporation,1,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,396216.0,140239.0,536455.0,2016

In [37]:
# save fuel comsumptio data as csv file
fuel_data.to_csv("Data/fuel_data.csv", index=False)